INSERT INTO teachers (last_name, first_name, middle_name) VALUES
('Иванов', 'Иван', 'Иванович'),
('Петрова', 'Анна', 'Сергеевна'),
('Сидоров', 'Алексей', 'Петрович'),
('Кузнецова', 'Мария', 'Игоревна'),
('Смирнов', 'Дмитрий', 'Андреевич');


INSERT INTO classes (name) VALUES
('9А'),
('9Б'),
('10А'),
('10Б');


INSERT INTO subjects (subject_name) VALUES
('Математика'),
('Русский язык'),
('Литература'),
('Английский язык'),
('Физика'),
('Химия'),
('Биология'),
('История');


INSERT INTO rooms (room_number, capacity) VALUES
(101, 30),
(102, 28),
(201, 25),
(202, 24),
(301, 32);


INSERT INTO lessons (
    class_id, teacher_id, subject_id, room_id,
    day_of_week, start_time, end_time
) VALUES
(1, 1, 1, 1, 1, '08:00', '08:45'),
(1, 2, 2, 2, 1, '09:00', '09:45'),
(1, 3, 3, 3, 1, '10:00', '10:45'),
(2, 4, 4, 4, 1, '11:00', '11:45'),

(1, 1, 5, 1, 2, '08:00', '08:45'),
(2, 2, 6, 2, 2, '09:00', '09:45'),
(3, 3, 7, 3, 2, '10:00', '10:45'),
(4, 5, 8, 5, 2, '11:00', '11:45'),

(1, 4, 1, 4, 3, '08:00', '08:45'),
(2, 1, 2, 1, 3, '09:00', '09:45'),
(3, 2, 3, 2, 3, '10:00', '10:45'),
(4, 3, 4, 3, 3, '11:00', '11:45'),

(1, 5, 5, 5, 4, '08:00', '08:45'),
(2, 4, 6, 4, 4, '09:00', '09:45'),
(3, 1, 7, 1, 4, '10:00', '10:45'),
(4, 2, 8, 2, 4, '11:00', '11:45'),

(1, 3, 1, 3, 5, '08:00', '08:45'),
(2, 5, 2, 5, 5, '09:00', '09:45'),
(3, 4, 3, 4, 5, '10:00', '10:45'),
(4, 1, 4, 1, 5, '11:00', '11:45');